[Demo_CommonKP_ep6_2_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-3072,Y=-53,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=270,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=-3072,Y=-243,Z=0),VecSub=(X=-90,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=POP,Name="怪物(飛行)",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',Vec=(X=-3072,Y=-1600,Z=1350),VecSub=(X=80,Y=0,Z=0),CId=257)
DemoScripts[6]=(Actor=CHARACTER,Command=ACTION,Name="怪物(飛行)",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="mb_DM_0100_lp_Wait",Number=9,CId=257,Bit=4)
DemoScripts[7]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0003_lp_open_surprise",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[8]=(Actor=CHARACTER,Command=PARAM,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Number=11,Vec=(X=-3072,Y=-1600,Z=1350))
DemoScripts[9]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Uneasy.GG2_BGM_DM_CMN_Uneasy_Cue')
DemoScripts[10]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Schoolzone.GG2_AMB_Schoolzone_LP_Cue')
DemoScripts[11]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[12]=(Actor=FADE,Command=WAIT)
DemoScripts[13]=(Actor=WINDOW,Command=SET)
DemoScripts[14]=(Actor=EMOTION,Command=SET,Name="エコロ",Number=2,CId=71)
DemoScripts[15]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Surprise_Cue')
DemoScripts[16]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonKP_ep6_2.GG2_V_CMNKP_ep6_2_001_Cue',Name="エコロ")
DemoScripts[17]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[18]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[19]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[20]=(Actor=WINDOW,Command=EXIT)
DemoScripts[21]=(Actor=CHARACTER,Command=PARAM,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Number=13,Bit=0,Rate=0)
DemoScripts[22]=(Actor=CHARACTER,Command=MOVE,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',SetType=ROT,Vec=(X=90,Y=0,Z=0),SecTime=0.5,CId=71)
DemoScripts[23]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[24]=(Actor=WINDOW,Command=SET)
DemoScripts[25]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonKP_ep6_2.GG2_V_CMNKP_ep6_2_003_Cue',Name="エコロ")
DemoScripts[26]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[27]=(Actor=WINDOW,Command=EXIT)
DemoScripts[28]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=-90,Y=40,Z=0),SecTime=1)
DemoScripts[29]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[30]=(Actor=FADE,Command=SET,SecTime=0.5,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_BACK)
DemoScripts[31]=(Actor=FADE,Command=WAIT)
DemoScripts[32]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-3072,Y=-200,Z=1370),SecTime=)
DemoScripts[33]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=10,Z=0),SecTime=)
DemoScripts[34]=(Actor=FADE,Command=EXIT,SecTime=0.5,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_BACK)
DemoScripts[35]=(Actor=FADE,Command=WAIT)
DemoScripts[36]=(Actor=WINDOW,Command=SET)
DemoScripts[37]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[38]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[39]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonKP_ep6_2.GG2_V_CMNKP_ep6_2_005_Cue',Name="エコロ")
DemoScripts[40]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[41]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[42]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[43]=(Actor=WINDOW,Command=EXIT)
DemoScripts[44]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0300_lp_Furry",Rate=0,Number=3,Bit=5)
DemoScripts[45]=(Actor=FADE,Command=SET,SecTime=0.5,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_BACK)
DemoScripts[46]=(Actor=FADE,Command=WAIT)
DemoScripts[47]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-3072,Y=-53,Z=135),SecTime=)
DemoScripts[48]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=270,Y=-5,Z=0),SecTime=)
DemoScripts[49]=(Actor=FADE,Command=EXIT,SecTime=0.5,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_BACK)
DemoScripts[50]=(Actor=FADE,Command=WAIT)
DemoScripts[51]=(Actor=WINDOW,Command=SET)
DemoScripts[52]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonKP_ep6_2.GG2_V_CMNKP_ep6_2_007_Cue',Name="エコロ")
DemoScripts[53]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[54]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[55]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[56]=(Actor=WINDOW,Command=EXIT)
DemoScripts[57]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[58]=(Actor=AMBIENT,Command=STOP,SecTime=1,SoundID=)
DemoScripts[59]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[60]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[61]=(Actor=SYSTEM,Command=END)

[Select_CommonKP_ep6_2_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_CommonKP_ep6_2_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="啊啊!?/n那是!!")

Texts[1]=(Label="TEXT02",Name="峯大",Text="怎麼了,艾可蘿?")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="請看!/n體育館的上面!")

Texts[3]=(Label="TEXT04",Name="峯大",Text="什......那是什麼!?/n難道說那也是魔物!?")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="看來似乎是這樣!/n真是不祥......感覺得到魔物特有的氣息!")

Texts[5]=(Label="TEXT06",Name="峯大",Text="庫蘿娜那傢伙,連那種東西都......!")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="要是那種東西鬧起來就不妙了!/n想辦法解決它吧!")

Texts[7]=(Label="TEXT08",Name="峯大",Text="體育館上面嗎....../n雖然有點危險,/n但也只能從屋頂過去了吧.......")

Texts[8]=(Label="",Name="",Text="")

Texts[9]=(Label="SELECT01",Name="",Text="")

Texts[10]=(Label="SELECT02",Name="",Text="")

Texts[11]=(Label="SELECT03",Name="",Text="")

Texts[12]=(Label="SELECT04",Name="",Text="")

Texts[13]=(Label="SELECT05",Name="",Text="")

Texts[14]=(Label="SELECT06",Name="",Text="")

Texts[15]=(Label="SELECT07",Name="",Text="")

Texts[16]=(Label="SELECT08",Name="",Text="")

Texts[17]=(Label="SELECT09",Name="",Text="")

Texts[18]=(Label="SELECT10",Name="",Text="")


